Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 244, 244, 1) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 242, 242, 16) 160         input_1[0][0]                    
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 121, 121, 16) 0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 119, 119, 32) 4640        average_pooling2d[0][0]          
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 59, 59, 32)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 57, 57, 64)   18496       average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
dropout (Dropout)               (None, 57, 57, 64)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 28, 28, 64)   0           dropout[0][0]                    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 50176)        0           average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           3211328     flatten[0][0]                    
__________________________________________________________________________________________________
classifier_head (Dense)         (None, 2)            130         dense[0][0]                      
__________________________________________________________________________________________________
regressor_head (Dense)          (None, 4)            260         dense[0][0]                      
==================================================================================================
Total params: 3,235,014
Trainable params: 3,235,014
Non-trainable params: 0
__________________________________________________________________________________________________
